src/cf/maERP_ib/src/Documents/СписаниеБезналичныхДенежныхСредств/СписаниеБезналичныхДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеБезналичныхДенежныхСредств</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеБезналичныхДенежныхСредств</basedOn>
  <basedOn>Document.ПриходныйКассовыйОрдер</basedOn>
  <basedOn>Document.ПоступлениеДополнительныхРасходов</basedOn>
  <basedOn>Document.ПрочиеРасходы</basedOn>
  <basedOn>Document.НалоговаяНакладнаяПокупка</basedOn>
  <registerRecords>AccumulationRegister.ОплатыЧеками</registerRecords>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияПоКассе</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.Зарплата</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредстваОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСКонтрагентамиПрочие</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>БанковскийСчёт</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчётКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречисленияВБюджет</name>
    <type>
      <types>EnumRef.ВидыПеречисленийВБюджет</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияБанком</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПлатежа</name>
    <comment>Поле 22 &quot;Код&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПлательщика</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>ИННПолучателя</name>
    <type>
      <types>DefinedType.NIF</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВидаДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодВыплат</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКТМО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>DefinedType.КонтрагентДенежныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППлательщика</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>КПППолучателя</name>
    <type>
      <types>DefinedType.RC</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОчередностьПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеречислениеВБюджет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательДаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательНомера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроведеноБанком</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСоставителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасчетаЗарплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>КассоваяСмена</name>
    <type>
      <types>DocumentRef.КассоваяСмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.TypesDePayment</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ВыплатаЗарплаты</types>
      <types>DocumentRef.ПлатёжнаяВедомостьНаАванс</types>
      <types>DocumentRef.ВозвратОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Чек</name>
    <type>
      <types>CatalogRef.БанковскиеЧеки</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалютеРеглУчета</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧОснования</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеРасходы</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
        <types>DocumentRef.НалоговаяНакладная</types>
        <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоСтавокНДС</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровкаНДС</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/maERP_ib/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>АвансКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗарплаты</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>НакладнаяПоОтгрузкамТовара</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеОприходование</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеСписание</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеДенежныхСредствНаБанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ПеречислениеНалоговИВзносов</name>
  </enumValues>
  <enumValues>
    <name>ПланируемыеЦеныЗакупки</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствСБанковскогоСчета</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПродажаВКредит</name>
  </enumValues>
  <enumValues>
    <name>ПрочееПоступлениеДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ПрочийРасходДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>РазукомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>СнятиеНаличныхДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>СписаниеЗадолженности</name>
  </enumValues>
  <enumValues>
    <name>УстановкаЦенНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>ОбналичиваниеЧека</name>
  </enumValues>
  <enumValues>
    <name>ОперационныеЗатраты</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
  <enumValues>
    <name>Инкассация</name>
  </enumValues>
</mdclass:Enum>

src/cf/maERP_ib/src/Documents/СписаниеБезналичныхДенежныхСредств/ManagerModule.bsl
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("НомерВходящегоДокумента");
	Поля.Добавить("ДатаВходящегоДокумента");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//Представление = Строка(Данные.ТипПлатежногоДокумента) + " исходящее";
	//Представление = Представление + " №" + ?(ЗначениеЗаполнено(Данные.НомерВходящегоДокумента), Данные.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(Данные.Номер));
	//ДатаДокумента = ?(ЗначениеЗаполнено(Данные.ДатаВходящегоДокумента), Данные.ДатаВходящегоДокумента, Данные.Дата);
	//Представление = Представление + " от " + Формат(ДатаДокумента, "ДЛФ=D");	
КонецПроцедуры

Функция МассивОперацийПеречисленияВБюджет() Экспорт	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ОплатаПоставщику);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ПеречислениеНалоговИВзносов);
	Результат.Добавить(Перечисления.ХозяйственныеОперации.ПрочийРасходДенежныхСредств);	
	Возврат Результат;	
КонецФункции

Процедура УстановитьРеквизитыПлательщикаПолучателя(Объект) Экспорт
	Объект.ИННПлательщика = Объект.Организация.NIF;
	Объект.КПППлательщика = Объект.Организация.RC;
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект.Контрагент, "NIF") Тогда
		Объект.ИННПолучателя = Объект.Контрагент.NIF;
	КонецЕсли;
	Если РаботаСДокументамиКлиентСервер.ЕстьРеквизит(Объект.Контрагент, "RC") Тогда
		Объект.КПППолучателя = Объект.Контрагент.RC;
	КонецЕсли;
КонецПроцедуры	

#Область Формирование_назначения_платежа

Функция НазначениеПлатежаПриРасчетахСРаботниками(Объект)
	Результат = "Для зачисления на счет";
	Если ЗначениеЗаполнено(Объект.Контрагент) и ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ТекстФИО = ОбщегоНазначения.ПросклонятьСтроку(Строка(Объект.Контрагент), ОбщегоНазначения.Падежи().Родительный, Объект.Контрагент.Пол); 
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстФИО, " ");
	КонецЕсли;
	Результат = Результат + Символы.ПС + "Заработная плата";	
	Возврат Результат;	
КонецФункции

Функция НазначениеПлатежаСотрудникам(Объект)
	Результат = "";
	Если ЗначениеЗаполнено(Объект.Контрагент) и ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ТекстФИО = ОбщегоНазначения.ПросклонятьСтроку(Строка(Объект.Контрагент), ОбщегоНазначения.Падежи().Родительный, Объект.Контрагент.Пол); 
		Результат = "Для зачисления на счет";
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстФИО, " ");
	КонецЕсли;		
	Если ПустаяСтрока(Результат) Тогда
		Результат = "Оплата без указания назначения";
	КонецЕсли;
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаДокумента.Код = "643" Тогда
		ВалютаДляПечати = "руб.";
	Иначе
		ВалютаДляПечати = СокрЛП(ВалютаДокумента.Наименование);
	КонецЕсли;	
	// Сумма
	ТекстСумма = "Сумма " + Формат(Объект.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + ВалютаДляПечати;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстСумма, Символы.ПС); 
	// НДС	
	ТЗОснования = Объект.ТЧОснования.Выгрузить();
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДокумента, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);	
	Возврат Результат;	
КонецФункции

Функция НазначениеПлатежа(Объект)
	Результат = "";
	ТЗОснования = Объект.ТЧОснования.Выгрузить();
	СуммаОснований = ТЗОснования.Итог("Сумма"); 
	СуммаАвансов = Объект.Сумма - СуммаОснований;
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	Если ВалютаДокумента.Код = "643" Тогда
		ВалютаДляПечати = "руб.";
	Иначе
		ВалютаДляПечати = СокрЛП(ВалютаДокумента.Наименование);
	КонецЕсли;	
	ПредставленияДокументов = ПолучитьПредставленияДокументов();	
	Для Каждого Стр Из ТЗОснования Цикл
		Если Не ЗначениеЗаполнено(Стр.Основание) Тогда Продолжить КонецЕсли;
		ВидДокумента = "";
		ПредставленияДокументов.Свойство(Стр.Основание.Метаданные().Имя, ВидДокумента);
		Если ЗначениеЗаполнено(ВидДокумента) Тогда
			ПредставлениеДляПечати = ВидДокумента;
			ДокОснование = Стр.Основание;
			Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Или ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				НомерДокумента = ?(ЗначениеЗаполнено(ДокОснование.НомерВходящегоДокумента), ДокОснование.НомерВходящегоДокумента, РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер));
				ДатаДокумента = ?(ЗначениеЗаполнено(ДокОснование.ДатаВходящегоДокумента), ДокОснование.ДатаВходящегоДокумента, ДокОснование.Дата);
			Иначе
				НомерДокумента = РаботаСДокументами.СформироватьЦифровойНомер(ДокОснование.Номер);
				ДатаДокумента = ДокОснование.Дата;
			КонецЕсли;
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, НомерДокумента, " №");
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, Формат(ДатаДокумента, "ДЛФ=D"), " от ");
			ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, "Сумма " + Формат(Стр.Сумма, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="), " ");
            ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(ПредставлениеДляПечати, ВалютаДляПечати, " ");
           	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ПредставлениеДляПечати, ", "); 
		КонецЕсли;
	КонецЦикла;	
	Если СуммаАвансов > 0 Тогда		
		Если СуммаОснований > 0 Тогда 
			ТекстНераспределённого = "без указания назначения ";
		Иначе
			ТекстНераспределённого = "договору № " + Объект.Договор.Код + " от " + Формат(Объект.Договор.ДатаДоговора, "ДЛФ=D");	
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстНераспределённого + Формат(СуммаАвансов, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + " " + ВалютаДляПечати, ", ");
	КонецЕсли;
	Результат = "Оплата по " + Результат;
	Если Прав(Результат, 1) <> "." Тогда
		Результат = Результат + ".";
	КонецЕсли;	
	ТекстСуммаНДС = ТекстСуммаНДСПлатежа(Объект.Организация, ВалютаДокумента, ТЗОснования, Истина);	
	РазместитьТекстСуммыНДС(Результат, ТекстСуммаНДС);
	Возврат Результат;	
КонецФункции

Функция ТекстСуммаНДСПлатежа(Организация, ВалютаДокумента, ТЗОснования, ДобавлятьТекстВТомЧисле) Экспорт
	Результат = "";
	ТЗНДС = ТЗОснования.Скопировать(, "СтавкаНДС, СуммаНДС");
	ТЗНДС.Очистить();
	Для Каждого Стр Из ТЗОснования Цикл
		Если Стр.НесколькоСтавокНДС и ЗначениеЗаполнено(Стр.РасшифровкаНДС) Тогда
			МасРасшифровкаНДС = ОбщегоНазначенияКлиентСервер.КонвертироватьИзJSON(Стр.РасшифровкаНДС);
			Для Каждого СтрНДС Из МасРасшифровкаНДС Цикл
				НС = ТЗНДС.Добавить();
	           	НС.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("Ставка",СтрНДС.Получить("СтавкаНДС"));
				НС.СуммаНДС = СтрНДС.Получить("СуммаНДС");
			КонецЦикла;	
		Иначе
			НС = ТЗНДС.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);
		КонецЕсли;	
	КонецЦикла;
	ТЗНДС.Свернуть("СтавкаНДС", "СуммаНДС");	
	Если ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		ПредставлениеВалюты = "руб.";
	Иначе
		ПредставлениеВалюты = СокрЛП(ВалютаДокумента);
	КонецЕсли;	
	Для Каждого Стр Из ТЗНДС Цикл
		Если Стр.СтавкаНДС.Ставка = 0 Или Не ЗначениеЗаполнено(Стр.СтавкаНДС) Тогда Продолжить КонецЕсли;
		СтрокаНДС = "НДС (" + Стр.СтавкаНДС + ") " + Формат(Стр.СуммаНДС, "ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ=") + " " + ПредставлениеВалюты;
		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, СтрокаНДС, ", ");
	КонецЦикла;
	Если ПустаяСтрока(Результат) Тогда
		Результат = "Без налога (НДС)";
	Иначе
		Если ДобавлятьТекстВТомЧисле Тогда
			Результат = "В т.ч." + " " + Результат;
		КонецЕсли;
	КонецЕсли;	
	Возврат Результат;	
КонецФункции

Функция ПолучитьПредставленияДокументов()
	Результат = Новый Структура;
	Результат.Вставить("ПоступлениеТоваровУслуг", "накладной");
	Результат.Вставить("РеализацияТоваровУслуг", "накладной");
   	Результат.Вставить("ПоступлениеБезналичныхДенежныхСредств", "платёжному поручению");
	Возврат Результат;	
КонецФункции

Процедура РазместитьТекстСуммыНДС(НазначениеПлатежа, ТекстСуммаНДС)
	ДлинаТекстаПолучателей = СтрДлина(НазначениеПлатежа);
	ДлинаТекстаНДС = СтрДлина(ТекстСуммаНДС);	
	Если ДлинаТекстаПолучателей + ДлинаТекстаНДС > 210 Тогда		
		ДлинаТекстаПолучателей = 207 - ДлинаТекстаНДС;
		НазначениеПлатежа = Лев(НазначениеПлатежа, ДлинаТекстаПолучателей);
		ТекстПоискаПоследнегоНазначения = НазначениеПлатежа;
		ПозицияПоследнейЗапятой = 0;
		ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");		
		Пока Не ПозицияЗапятой = 0 Цикл			
			ПозицияПоследнейЗапятой = ПозицияПоследнейЗапятой + ПозицияЗапятой;
			ТекстПоискаПоследнегоНазначения = Сред(ТекстПоискаПоследнегоНазначения, ПозицияЗапятой + 1);
			ПозицияЗапятой = СтрНайти(ТекстПоискаПоследнегоНазначения, ",");			
		КонецЦикла;		
		НазначениеПлатежа = Лев(НазначениеПлатежа, ПозицияПоследнейЗапятой - 1) + "...";		
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(НазначениеПлатежа, ТекстСуммаНДС, Символы.ПС);	
КонецПроцедуры	

#КонецОбласти
